package test.first;

/*
Длина Московской кольцевой автомобильной дороги — 109 километров. Байкер Вася стартует с нулевого километра МКАД и
едет со скоростью v километров в час. На какой отметке он остановится через t часов?
        Формат ввода
Программа получает на вход v и t. Если v > 0, то Вася движется в положительном направлении по МКАД, если же значение
v < 0, то в отрицательном.(Гарантируется, что исходные числа — целые и находятся в промежутке от -1000 до +1000).
        Формат вывода
Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.
        Пример
        Ввод
        60
        2
        Вывод
        11
*/
import java.util.Scanner;

public class Mkad {

    public static void main(String[] args) {
        int v = 0;
        int t = 0;
        final int ring = 109;
        int s1 = 0;

        Scanner sc = new Scanner(System.in);
        v = sc.nextInt();
        t = sc.nextInt();

        int s = v * t;

        if (v > 0) {
            do {
                s1 = ring - s;
                System.out.println(s1);
            } while (ring < s);
        }
        if (v < 0) {
            do {
                s1 = ring + s;
                System.out.println(-s1);
            } while (-ring > s);
        }
    }
}
